app/controllers/d_control_controller.rb

SELECT "hosts".* FROM "hosts"
---
  def index
    info = params[:type]
    #Set up how the view works
    view = params[:view]

    #For single view
    if info.to_s == 'hosts' and view.to_s == 's'
      @selected = Host.all