app/controllers/hosts_controller.rb

  def index
    @hosts = Host.all
---
SELECT "hosts".* FROM "hosts"

  def show
    @host = Host.find(params[:id])
---
SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT 1  [["id", "100"]]

  def edit
    @host = Host.find(params[:id])
---
SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT 1  [["id", "100"]]

  def create
    @host = Host.new(params[:host])

    respond_to do |format|
      if @host.save
---
INSERT INTO "hosts" ("boot_time", "cpu_core_count", "cpu_count", "cpu_hz", "cpu_model", "cpu_power_mgmt_policy", "cpu_power_mgmt_support", "cpu_thread_count", "created_at", "datacenter_id", "dns_name", "gathered", "hba_count", "host_model", "host_vendor", "id", "ip_address", "last_perf_time", "mem_size", "nic_count", "perf_refresh_rate", "product_api_version", "product_build", "product_fullname", "product_line_id", "product_name", "product_os_type", "product_vendor", "product_version", "rank", "updated_at", "vsid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @host = Host.find(params[:id])
---
SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT 1  [["id", "100"]]

  def destroy
    @host = Host.find(params[:id])
    @host.destroy
---
SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT 1  [["id", "100"]]
DELETE FROM "hosts" WHERE "hosts"."id" = ?  [["id", 100]]